init.org
#+TITLE: Literate Emacs
#+babel: :cache yes
#+property: tangle ./org-init.el
#+property: header-args :tangle ./org-init.el :comments yes :results output silent

* Preface
This is my attempt at modularizing my =.emacs.d= directory and preventing eventual /Emacs Bankruptcy/ by exporting my configurations through the [[http://orgmode.org/][org-mode]] [[https://orgmode.org/manual/tangle.html][tangle]] system.

I am still in the progress of figuring out the best structure for this kind document. Scattered around the file you might find a plethora of =TODO=-markings for all different kinds of stuff.

Most of this file has unfortunately been written in a really inconsistent style. This applies to its structure as well as the language used.

These are some of the things that (probably) will need to be fixed at some point:

+ Structure
  + Linebreaks in/after sentences
  + Code blocks
    + Blank lines at beginning/end?
    + Blank lines before/after?
  + Footnotes
+ Language
  + Inconsistent third/first person
  + Inconsistent formality
  + Active/Passive
    + This does that
    + Do that here
  + Repetition of phrases
  + Strange sentence structure
+ Spelling
  + General spelling mistakes
  + Uppercase/Downcase
    + Lists
    + Package names
    + Application names

Please don't use this on your own machine. Just don't. [fn:dotfiles]


This setup was heavily inspired by [[https://github.com/wasamasa][wasamasa]]s [[https://github.com/wasamasa/dotemacs][dotemacs]] repository.

* Package management
As using Emacs without any extensions[fn:extensions] is pretty undesirable, the ability to easily and quickly load collections of elisp from external sources. However the builtin way of achieving this (package.el + =require=) is wonky at best.

For this reason I choose to leave package.el behind and instead use the new and shiny straight.el in conjunction with use-package, which acts as an improved =require= wrapper.

** straight.el

This package is responsible for correctly setting the load path to various collections of elisp code that live in =.emacs.d/straight=. straight.el ensures absolute configuration reproducibility through its use of a lockfile located in =straight/versions/default.el=. It also allows my own packages to comfortably live inside =straight/repos= as it's various end-user functions allow for interactively managing state changes.

#+begin_src elisp

(setq straight-check-for-modifications
      '(find-when-checking check-on-save))
      
(setq straight-recipe-repositories
      '(org-elpa melpa emacsmirror gnu-elpa))
      
#+end_src

This package has to be loaded first and using a manual `bootstrap` procedure, because it is the package responsible for loading all other packages. (Chicken and Egg)

#+begin_src elisp

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
  
#+end_src

*** org-mode hack

This is the first of hopefully only a few `hacks`, configuration snippets that are particularly unidiomatic and maybe even impossible to understand without knowledge of the associated extensions, mostly because they have to account for some edge-case of said extension, I will have to use in this configuration.

Without this snippet Emacs would load the outdated version of org-mode distributed with its source code, instead of the upstream package from org-elpa. [fn:org-hack]


#+begin_src elisp

(require 'subr-x)
(straight-use-package 'git)

(defun org-git-version ()
  "The Git version of org-mode.
Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (git-run "describe"
              "--match=release\*"
              "--abbrev=6"
              "HEAD"))))

(defun org-release ()
  "The release version of org-mode.
Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (string-remove-prefix
      "release_"
      (git-run "describe"
               "--match=release\*"
               "--abbrev=0"
               "HEAD")))))


;; immediately load the correct org package
(straight-use-package 'org-plus-contrib)

#+end_src

