init.md
- [Preface](#org6ab6f86)
- [Package management](#org331a958)
  - [straight.el](#org0d74e0a)
    - [org-mode hack](#orgf8c77bf)
    - [hydra](#org2793f8e)
  - [use-package](#orgd0748c2)
    - [use-config macro](#org022bbb6)
  - [no-littering](#orgb9fc89f)
- [Configuration](#org929a1b1)
  - [Helpers](#org21b21c2)
    - [bug-hunter](#org9b8ae84)
    - [general](#org4df9422)
    - [lib](#org4b3411f)
  - [Emacs](#org08b5909)
    - [Default](#orgb3b4906)
    - [Look](#org939d311)
    - [Navigation](#org5da5411)
    - [OS Integration](#org82ac931)
    - [Extensible Interfaces](#orga4008d4)
    - [Saving](#orgc148458)
  - [Editing](#org89b9ece)
    - [Prelude-esque](#org53925c0)
    - [Visual line](#org880f4af)
    - [Pairs](#org804d99a)
    - [Snippets](#org8e34657)
    - [Jumping](#org04edb98)
  - [Programming](#org9b6cb4a)
    - [Defaults](#org88ab24e)
    - [LSP/DAP family](#org31bcba5)
    - [Projectile](#org8231b55)
    - [Company](#org389b614)
    - [Outline/shine](#orgd850aee)
    - [Flycheck](#org4def239)
    - [Fly/ispell](#orgac444a9)
  - [Languages](#orge9644cb)
    - [Emacs Lisp](#orgdcccf2d)
    - [Haskell](#orgc9dde88)
    - [Nix](#org236e104)
    - [TeX/LaTeX](#org8979e40)
    - [Markdown](#org1fd3e7d)
    - [Python](#orgbcaeb1a)
    - [Rust](#orgfc01ea3)
    - [Shell](#org162689b)
  - [Misc](#orgc0e1656)
    - [Files/Dired](#org338db5d)
    - [Git/Magit](#org2d52b0b)
    - [Music/MPD](#orgca59335)
    - [Mail](#org519a6fb)
    - [Org](#org11359b7)
    - [RSS/Elfeed](#org4ce92af)
- [End](#org2caab55)



<a id="org6ab6f86"></a>

# Preface

This is my attempt at modularizing my `.emacs.d` directory and preventing eventual *Emacs Bankruptcy* by exporting my configurations through the [org-mode](http://orgmode.org/) [tangle](https://orgmode.org/manual/tangle.html) system.

I am still in the progress of figuring out the best structure for this kind document. Scattered around the file you might find a plethora of `TODO`-markings for all different kinds of stuff.

Most of this file has unfortunately been written in a really inconsistent style. This applies to its structure as well as the language used.

These are some of the things that (probably) will need to be fixed at some point:

-   Structure
    -   Linebreaks in/after sentences
    -   Code blocks
        -   Blank lines at beginning/end?
        -   Blank lines before/after?
    -   Footnotes
-   Language
    -   Inconsistent third/first person
    -   Inconsistent formality
    -   Active/Passive
        -   This does that
        -   Do that here
    -   Repetition of phrases
    -   Strange sentence structure
-   Spelling
    -   General spelling mistakes
    -   Uppercase/Downcase
        -   Lists
        -   Package names
        -   Application names

Please don't use this on your own machine. Just don't. <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>

This setup was heavily inspired by [wasamasa](https://github.com/wasamasa)s [dotemacs](https://github.com/wasamasa/dotemacs) repository.


<a id="org331a958"></a>

# Package management

As using Emacs without any extensions<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> is pretty undesirable, the ability to easily and quickly load collections of elisp from external sources. However the builtin way of achieving this (package.el + `require`) is wonky at best.

For this reason I choose to leave package.el behind and instead use the new and shiny straight.el in conjunction with use-package, which acts as an improved `require` wrapper.


<a id="org0d74e0a"></a>

## straight.el

This package is responsible for correctly setting the load path to various collections of elisp code that live in `.emacs.d/straight`. straight.el ensures absolute configuration reproducibility through its use of a lockfile located in `straight/versions/default.el`. It also allows my own packages to comfortably live inside `straight/repos` as it's various end-user functions allow for interactively managing state changes.

```elisp

(setq straight-check-for-modifications
      '(find-when-checking check-on-save))

(setq straight-recipe-repositories
      '(org-elpa melpa emacsmirror gnu-elpa))

```

This package has to be loaded first and using a manual \`bootstrap\` procedure, because it is the package responsible for loading all other packages. (Chicken and Egg)

```elisp

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

```


<a id="orgf8c77bf"></a>

### org-mode hack

This is the first of hopefully only a few \`hacks\`, configuration snippets that are particularly unidiomatic and maybe even impossible to understand without knowledge of the associated extensions, mostly because they have to account for some edge-case of said extension, I will have to use in this configuration.

Without this snippet Emacs would load the outdated version of org-mode distributed with its source code, instead of the upstream package from org-elpa. <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>

```elisp

(require 'subr-x)
(straight-use-package 'git)

(defun org-git-version ()
  "The Git version of org-mode.
Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (git-run "describe"
              "--match=release\*"
              "--abbrev=6"
              "HEAD"))))

(defun org-release ()
  "The release version of org-mode.
Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (string-remove-prefix
      "release_"
      (git-run "describe"
               "--match=release\*"
               "--abbrev=0"
               "HEAD")))))


;; immediately load the correct org package
(straight-use-package 'org-plus-contrib)

```
