init.md


<a id="org2793f8e"></a>

### hydra

The official hydra wiki provides a hydra for working with straight.el

The code uses `with-eval-after-load` instead of the superior `use-config` because it has not yet been defined at this point.

```elisp

(with-eval-after-load straight
  (with-eval-after-load hydra
    (defhydra hydra-straight-helper (:hint nil)
      "
_c_heck all       |_f_etch all     |_m_erge all      |_n_ormalize all   |p_u_sh all
_C_heck package   |_F_etch package |_M_erge package  |_N_ormlize package|p_U_sh package
----------------^^+--------------^^+---------------^^+----------------^^+----_q_uit----|
_r_ebuild all     |_p_ull all      |_v_ersions freeze|_w_atcher start   |_g_et recipe
_R_ebuild package |_P_ull package  |_V_ersions thaw  |_W_atcher quit    |prun_e_ build"
      ("c" straight-check-all)
      ("C" straight-check-package)
      ("r" straight-rebuild-all)
      ("R" straight-rebuild-package)
      ("f" straight-fetch-all)
      ("F" straight-fetch-package)
      ("p" straight-pull-all)
      ("P" straight-pull-package)
      ("m" straight-merge-all)
      ("M" straight-merge-package)
      ("n" straight-normalize-all)
      ("N" straight-normalize-package)
      ("u" straight-push-all)
      ("U" straight-push-package)
      ("v" straight-freeze-versions)
      ("V" straight-thaw-versions)
      ("w" straight-watcher-start)
      ("W" straight-watcher-quit)
      ("g" straight-get-recipe)
      ("e" straight-prune-build)
      ("q" nil))))

```


<a id="orgd0748c2"></a>

## use-package

This package provides a wrapper macro around Emacs' builtin way of =require=ing packages. It allows for easily specifying the correct order elisp code should be run at, without heavily jeopardizing the actual structure of said code.

Straight.el also provides integration with use-package, allowing for the use of `:straight t`<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> instead of the builtin `:ensure t`. Use-package itself of course gets loaded using only the `straight-use-package` function provided by straight.el

```elisp
(straight-use-package 'use-package)
```


<a id="org022bbb6"></a>

### use-config macro

I like split the configuration block of a package from its use-package block for visual clarity. Especially with org-tangle, where I can specify the `use-config` macro to wrap a code block, this approach makes the configuration much more readable.

[TODO: add use-package error handling]

```elisp

(defmacro use-config (after &rest body)
  "use-package like wrapper for configurations"
  (macroexp-progn
   (use-package-require-after-load after body)))

(put 'use-config 'lisp-indent-function 'defun)

```


<a id="orgb9fc89f"></a>

## no-littering

No-littering is a useful Emacs extension that tries to revert any inconsistent paths used by popular or builtin packages and instead sets them to semantic entries in either `.emacs.d/var` or `.emacs.d/etc`.

```elisp

(use-package no-littering
  :straight t)

(use-config (no-littering recentf)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))

```


<a id="org929a1b1"></a>

# Configuration

The heart and soul of this file and by extension of my Emacs configuration. Headers are grouped by their most significant functionality. If no logical order is present, alphabetical order should be upheld. [TODO] <sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>


<a id="org21b21c2"></a>

## Helpers

This header contains configurations or packages with the main purpose of easing the configuration of other packages. For this reason they have to be loaded very early during the initialization. <sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>


<a id="org9b8ae84"></a>

### bug-hunter

Putting this package here might seem like a bit of a stretch, but I think being able to easily debug generic problems is important for any Emacs configuration.

```elisp
(use-package bug-hunter
  :straight t
  :defer t)
```


<a id="org4df9422"></a>

### general

General allows for easy mapping of keys to commands by adding an abstraction over the builtin `define-key` many well known key-centric extensions such as evil.

```elisp

(use-package general
  :straight t
  :defer t)

```

1.  general key-fn

    `key-fn` is an elisp macro written by myself in order to ease the mapping of non-`interactive` functions to keys with general. It also extends generals which-key integration.
    
    ```elisp
    
    (defmacro key-fn (action &rest args)
      (let ((fun-name (intern (format "my/general-which-key-functions-%s-%s" (symbol-name action) args))))
        `(progn
           (defun ,fun-name ()
             (interactive)
             (apply ',action ',args))
           (quote (,fun-name
                   :wk ,(concat (symbol-name action)
                                "-"
                                (mapconcat 'identity args "-")))))))
    
    ```
    
    Here are some usage examples:
    
    ```elisp
    
    (general-define-key
     "C-y" (key-fn insert "yes"))
    
    ```


<a id="org4b3411f"></a>

### lib

1.  subr

    Subr is an emacs-lisp library that provides common reusable subroutines. It is distributed with Emacs. I use it in some of my functions and configurations.
    
    ```elisp
    (use-package subr)
    ```

2.  dash

    Dash is a modern list library for emacs-lisp which can replace the outdated cl-lib libraries. I use it in some of my functions and configurations.
    
    ```elisp
    (use-package dash
      :straight t
      :config
      (dash-enable-font-lock))
    ```

3.  f

    F is a modern emacs-lisp library for working with files and filesystem paths. I use it in some of my functions and configurations.
    
    ```elisp
    (use-package f
      :straight t)
    ```

4.  s

    S is a modern emacs-lisp library for string manipulation. I use it in some of my functions and configurations.
    
    ```elisp
    (use-package s
      :straight t)
    ```


<a id="org08b5909"></a>

## Emacs

This is the subtree for configurations that affect all of Emacs.
