org-init.el

;; [[file:~/.emacs.d/init.org::*hydra][hydra:1]]
(with-eval-after-load straight
  (with-eval-after-load hydra
    (defhydra hydra-straight-helper (:hint nil)
      "
_c_heck all       |_f_etch all     |_m_erge all      |_n_ormalize all   |p_u_sh all
_C_heck package   |_F_etch package |_M_erge package  |_N_ormlize package|p_U_sh package
----------------^^+--------------^^+---------------^^+----------------^^+----_q_uit----|
_r_ebuild all     |_p_ull all      |_v_ersions freeze|_w_atcher start   |_g_et recipe
_R_ebuild package |_P_ull package  |_V_ersions thaw  |_W_atcher quit    |prun_e_ build"
      ("c" straight-check-all)
      ("C" straight-check-package)
      ("r" straight-rebuild-all)
      ("R" straight-rebuild-package)
      ("f" straight-fetch-all)
      ("F" straight-fetch-package)
      ("p" straight-pull-all)
      ("P" straight-pull-package)
      ("m" straight-merge-all)
      ("M" straight-merge-package)
      ("n" straight-normalize-all)
      ("N" straight-normalize-package)
      ("u" straight-push-all)
      ("U" straight-push-package)
      ("v" straight-freeze-versions)
      ("V" straight-thaw-versions)
      ("w" straight-watcher-start)
      ("W" straight-watcher-quit)
      ("g" straight-get-recipe)
      ("e" straight-prune-build)
      ("q" nil))))
;; hydra:1 ends here

;; [[file:~/.emacs.d/init.org::*use-package][use-package:1]]
(straight-use-package 'use-package)
;; use-package:1 ends here

;; [[file:~/.emacs.d/init.org::*use-config%20macro][use-config macro:1]]
(defmacro use-config (after &rest body)
  "use-package like wrapper for configurations"
  (macroexp-progn
   (use-package-require-after-load after body)))

(put 'use-config 'lisp-indent-function 'defun)
;; use-config macro:1 ends here

;; [[file:~/.emacs.d/init.org::*no-littering][no-littering:1]]
(use-package no-littering
  :straight t)

(use-config (no-littering recentf)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))
;; no-littering:1 ends here

;; [[file:~/.emacs.d/init.org::*bug-hunter][bug-hunter:1]]
(use-package bug-hunter
  :straight t
  :defer t)
;; bug-hunter:1 ends here

;; [[file:~/.emacs.d/init.org::*general][general:1]]
(use-package general
  :straight t
  :defer t)
;; general:1 ends here

;; [[file:~/.emacs.d/init.org::*general%20key-fn][general key-fn:1]]
(defmacro key-fn (action &rest args)
  (let ((fun-name (intern (format "my/general-which-key-functions-%s-%s" (symbol-name action) args))))
    `(progn
       (defun ,fun-name ()
         (interactive)
         (apply ',action ',args))
       (quote (,fun-name
               :wk ,(concat (symbol-name action)
                            "-"
                            (mapconcat 'identity args "-")))))))
;; general key-fn:1 ends here

;; [[file:~/.emacs.d/init.org::*subr][subr:1]]
(use-package subr)
;; subr:1 ends here

;; [[file:~/.emacs.d/init.org::*dash][dash:1]]
(use-package dash
  :straight t
  :config
  (dash-enable-font-lock))
;; dash:1 ends here

;; [[file:~/.emacs.d/init.org::*f][f:1]]
(use-package f
  :straight t)
;; f:1 ends here

;; [[file:~/.emacs.d/init.org::*s][s:1]]
(use-package s
  :straight t)
;; s:1 ends here
