init.org
*** Default
This subtree contains redefinitions for built-in Emacs settings I dislike/want changed.

Increase garbage collector threshold. Also manually set maximum recursion and definiton values.
#+begin_src elisp
(setq gc-cons-threshold 50000000)
(setq max-specpdl-size 1200)
(setq max-lisp-eval-depth 800)
#+end_src

Only show y-or-n prompts, even for "important" stuff.
#+begin_src elisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

Show all messages
#+begin_src elisp
(setq inhibit-message nil)
#+end_src

Disallow recursive minibuffers, as they can sometimes cause weird glitches that require Emacs to be restarted.
#+begin_src 
(setq enable-recursive-minibuffers nil)
#+end_src

Disable Emacs from following symlinks as it can lead to unexpected behavior.
#+begin_src elisp
(setq find-file-visit-truename nil)
#+end_src

*** Look
By default Emacs is not much to look at, but by setting some builtin options and loading a nice theme this can easily be changed.

#+begin_src elisp

(scroll-bar-mode 0)
(menu-bar-mode 0)
(toggle-scroll-bar 0)
(tool-bar-mode 0)

#+end_src

**** Themes
There are many nice themes for Emacs.
I personally happen to enjoy the doom, sanityinc and poet families of themes.

#+begin_src elisp

(use-package doom-themes
  :straight t
  :defer t)

(use-package color-theme-sanityinc-tomorrow
  :straight t
  :defer t)

(use-package color-theme-sanityinc-solarized
  :straight t
  :defer t)

(use-package poet-theme
  :straight t
  :defer t)
  
#+end_src

I have also created my own theme

#+begin_src elisp
(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
#+end_src

By default Emacs seems to assume that all themes are in fact malware. Disable this behavior.

#+begin_src elisp
(setq custom-safe-themes t)
#+end_src

Sometimes I want to just remove all active themes for debugging purposes. Add a function to easily achieve this.

#+begin_src elisp
(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))
#+end_src

Because I switch between different themes relatively often, I would like Emacs to always remember and load my currently active theme.
This is achieved here using desktop-mode. [TODO: test this]

#+begin_src elisp
(add-to-list 'desktop-globals-to-save 'custom-enabled-themes)
(add-hook 'desktop-after-read-hook (lambda ()
                                     (mapc 'load-theme
                                           custom-enabled-themes)))
#+end_src

**** Modeline
The Emacs modeline is a place for buffers to display arbitrary information grouped in blocks.
The content it shows is defined in the =mode-line-format= variable.

There are different packages that allow one to easily create nice modeline setups.
I currently am swithing between doom-modeline and moody.

#+begin_src elisp

(use-package doom-modeline
  :straight t
  :defer t
  :hook (after-init . doom-modeline-init))

(use-package all-the-icons
  :straight t
  :defer t)

;; (use-package moody
;;   :straight t)

;; (use-config moody
;;   (setq x-underline-at-descent-line t)
;;   (when (not (member '(vc-mode moody-vc-mode) mode-line-format))
;;     (moody-replace-mode-line-buffer-identification)
;;     (moody-replace-vc-mode)))

#+end_src

**** Dashboard
Dashboard is an Emacs package ripped from the spacemacs distribution.
It, like the name suggests, provides a dashboard that can display all different types of content.

Some keys for easier dashboard navigation are bound.

#+begin_src elisp
(use-package dashboard
  :straight t
  :after (evil projectile))

(use-config dashboard
  (setq dashboard-startup-banner "~/.emacs.d/resources/icon.png")
  (setq dashboard-banner-logo-title "Emacs is sexy!")
  (setq dashboard-items '((recents  . 5)
                          (projects . 5)
                          (bookmarks . 5)
                          (agenda . 5))))

(general-define-key
 :keymaps 'dashboard-mode-map
 :states 'normal
 "SPC" 'dashboard-next-section
 "S-SPC" 'dashboard-previous-section
 "r" 'dashboard-refresh-buffer)

#+end_src

I like to see my dashboard when I open a new frame.

#+begin_src elisp
(defun my/get-or-create-dashboard (&optional concise)
  ;; DONE: Prevent recursive calls from server-process-filter.
  (let ((buffer (get-buffer "*dashboard*")))
    (recentf-cleanup)
    (if buffer
        buffer
      (progn
        (dashboard-insert-startupify-lists)
        (get-buffer "*dashboard*")))))

(setq inhibit-splash-screen nil)
(setq initial-buffer-choice (lambda () (my/get-or-create-dashboard)))
#+end_src

**** Scrollbar
The yascroll package provides a nice vertical scrollbar that also works in  the terminal. Unfortunately it is no longer maintained and somewhat buggy.
Disable it for now.

#+begin_src elisp

;; (use-package yascroll
;;   :straight t
;;   :defer t
;;   :config
;;   (require 'cl)
;;   (setq yascroll:delay-to-hide 0.5))

;; (global-yascroll-bar-mode 1)

#+end_src

**** Page breaks
Many Emacs buffers use the =^L= character to indicate a page break.
This package automatically replaces them with a pretty horizontal line.

#+begin_src elisp
(use-package page-break-lines
  :straight t
  :config
  (global-page-break-lines-mode))
#+end_src

*** Navigation
Switching from mostly using terminal utilities to Emacs, the challenge I have faced is having to navigate the large amount of buffers that accumulate during a typical Emacs session.
I still consider what I have achieved so far suboptimal and will have to thoroughly and incrementally improve this part of my configuration until I get something that is usable.

Important concepts include window management, buffer management, finding of files [fn:dired-where] as well as automatic grouping and skipping of buffers.

