org-init.el

;; [[file:~/.emacs.d/init.org::*Default][Default:1]]
(setq gc-cons-threshold 50000000)
(setq max-specpdl-size 1200)
(setq max-lisp-eval-depth 800)
;; Default:1 ends here

;; [[file:~/.emacs.d/init.org::*Default][Default:2]]
(fset 'yes-or-no-p 'y-or-n-p)
;; Default:2 ends here

;; [[file:~/.emacs.d/init.org::*Default][Default:3]]
(setq inhibit-message nil)
;; Default:3 ends here

;; [[file:~/.emacs.d/init.org::*Default][Default:4]]
(setq find-file-visit-truename nil)
;; Default:4 ends here

;; [[file:~/.emacs.d/init.org::*Look][Look:1]]
(scroll-bar-mode 0)
(menu-bar-mode 0)
(toggle-scroll-bar 0)
(tool-bar-mode 0)
;; Look:1 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:1]]
(use-package doom-themes
  :straight t
  :defer t)

(use-package color-theme-sanityinc-tomorrow
  :straight t
  :defer t)

(use-package color-theme-sanityinc-solarized
  :straight t
  :defer t)

(use-package poet-theme
  :straight t
  :defer t)
;; Themes:1 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:2]]
(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
;; Themes:2 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:3]]
(setq custom-safe-themes t)
;; Themes:3 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:4]]
(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))
;; Themes:4 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:5]]
(add-to-list 'desktop-globals-to-save 'custom-enabled-themes)
(add-hook 'desktop-after-read-hook (lambda ()
                                     (mapc 'load-theme
                                           custom-enabled-themes)))
;; Themes:5 ends here

;; [[file:~/.emacs.d/init.org::*Modeline][Modeline:1]]
(use-package doom-modeline
  :straight t
  :defer t
  :hook (after-init . doom-modeline-init))

(use-package all-the-icons
  :straight t
  :defer t)

;; (use-package moody
;;   :straight t)

;; (use-config moody
;;   (setq x-underline-at-descent-line t)
;;   (when (not (member '(vc-mode moody-vc-mode) mode-line-format))
;;     (moody-replace-mode-line-buffer-identification)
;;     (moody-replace-vc-mode)))
;; Modeline:1 ends here

;; [[file:~/.emacs.d/init.org::*Dashboard][Dashboard:1]]
(use-package dashboard
  :straight t
  :after (evil projectile))

(use-config dashboard
  (setq dashboard-startup-banner "~/.emacs.d/resources/icon.png")
  (setq dashboard-banner-logo-title "Emacs is sexy!")
  (setq dashboard-items '((recents  . 5)
                          (projects . 5)
                          (bookmarks . 5)
                          (agenda . 5))))

(general-define-key
 :keymaps 'dashboard-mode-map
 :states 'normal
 "SPC" 'dashboard-next-section
 "S-SPC" 'dashboard-previous-section
 "r" 'dashboard-refresh-buffer)
;; Dashboard:1 ends here

;; [[file:~/.emacs.d/init.org::*Dashboard][Dashboard:2]]
(defun my/get-or-create-dashboard (&optional concise)
  ;; DONE: Prevent recursive calls from server-process-filter.
  (let ((buffer (get-buffer "*dashboard*")))
    (recentf-cleanup)
    (if buffer
        buffer
      (progn
        (dashboard-insert-startupify-lists)
        (get-buffer "*dashboard*")))))

(setq inhibit-splash-screen nil)
(setq initial-buffer-choice (lambda () (my/get-or-create-dashboard)))
;; Dashboard:2 ends here

;; [[file:~/.emacs.d/init.org::*Scrollbar][Scrollbar:1]]
;; (use-package yascroll
;;   :straight t
;;   :defer t
;;   :config
;;   (require 'cl)
;;   (setq yascroll:delay-to-hide 0.5))

;; (global-yascroll-bar-mode 1)
;; Scrollbar:1 ends here

;; [[file:~/.emacs.d/init.org::*Page%20breaks][Page breaks:1]]
(use-package page-break-lines
  :straight t
  :config
  (global-page-break-lines-mode))
;; Page breaks:1 ends here
