init.md


<a id="org82ac931"></a>

### OS Integration

While living in Emacs is *of course* the ultimate goal, I would also like to enjoy some of the benefits the last +40 years have brought us. Being able to actually browse modern webpages is OFC also a plus.

```elisp
(setq browse-url-generic-program "firefox")
```

```elisp

(use-package openwith
  :straight t
  :config
  (openwith-mode t)
  (setq openwith-associations nil))

(use-config openwith
   (setq openwith-associations '(("\\.pdf\\'" "zathura" (file)))))

```


<a id="orga4008d4"></a>

### Extensible Interfaces

Because Emacs is so very extensible, it is also possible to add entirely new interfaces to its core functionality. Many of these "interface extensions" are some of the most widely used Emacs packages. Packages that fall into this category might include the builtin IDO, helm and ivy. They are often referred to as "narrowing completion frameworks". Other than that there is also hydra, a package for defining colorful keyboard-centric pop-up menus and evil, the extensible vi layer. <sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>

1.  ivy

    Ivy is the best available narrowing completion framework. It, unlike helm, makes use of the minibuffer as its main interface. The ivy repo also includes swiper, an isearch replacement with an overview and the counsel utilities, which are wrappers arround existing commands with added ivy completion. Moreover by enabling `ivy-mode` you may allow ivy to automatically hijack well known completion functions.
    
    Keys for binding different types of dispatch MAYBE bound in the future.
    
    ```elisp
    
    (use-package ivy
      :straight t
      :init
      (setq ivy-do-completion-in-region nil)
      :config
      (ivy-mode 1))
    
    ;; (use-package swiper
    ;;   ;; swiper is distributed with ivy
    ;;   :after ivy)
    
    (use-package counsel
      :straight t
      :after ivy)
    
    ```
    
    ```elisp
    
    (use-config ivy
      (setq ivy-use-selectable-prompt t))
    
    ;; (general-define-key
    ;; :keymaps 'ivy-minibuffer-map
    ;; :states 'insert
    ;; "<RET>" 'ivy-done
    ;; "<tab>" 'ivy-partial-or-done)
    
    ```
    
    ```elisp
    
    ;; swiper
    (general-define-key
     :keymaps 'override
     :states '(normal visual)
     "/" 'swiper)
    
    ```
    
    A hydra for easier navigation is also provided. Keys for accessing the hydra in ivy-minibuffers are bound.
    
    ```elisp
    
    (general-define-key
     :keymaps 'ivy-minibuffer-map
     :states '(insert normal)
     "C-o" 'better-ivy/body
     "<escape>" 'better-ivy/keyboard-escape-quit-and-exit)
    
    (use-config (ivy hydra)
      (defhydra better-ivy (:hint nil :color pink)
        "
     Move     ^^^^^^^^^^ | Call         ^^^^ | Cancel^^ | Options^^ | Action _w_/_s_/_a_: %s(ivy-action-name)
    ----------^^^^^^^^^^-+--------------^^^^-+-------^^-+--------^^-+---------------------------------
     _g_ ^ ^ _k_ ^ ^ _u_ | _f_orward _o_ccur | _i_nsert | _c_alling: %-7s(if ivy-calling \"on\" \"off\") _C_ase-fold: %-10`ivy-case-fold-search
     ^↨^ _h_ ^+^ _l_ ^↕^ | _RET_ done     ^^ | _q_uit   | _m_atcher: %-7s(ivy--matcher-desc) _t_runcate: %-11`truncate-lines
     _G_ ^ ^ _j_ ^ ^ _d_ | _TAB_ alt-done ^^ | ^ ^      | _<_/_>_: shrink/grow
    "
        ;; arrows
        ("j" ivy-next-line)
        ("k" ivy-previous-line)
        ("l" ivy-alt-done)
        ("h" ivy-backward-delete-char)
        ("g" ivy-beginning-of-buffer)
        ("G" ivy-end-of-buffer)
        ("d" ivy-scroll-up-command)
        ("u" ivy-scroll-down-command)
        ("e" ivy-scroll-down-command)
        ;; actions
        ("q" keyboard-escape-quit :exit t)
        ("C-g" keyboard-escape-quit :exit t)
        ("<escape>" keyboard-escape-quit :exit t)
        ("C-o" nil)
        ("i" nil)
        ("TAB" ivy-alt-done :exit nil)
        ("C-j" ivy-alt-done :exit nil)
        ;; ("d" ivy-done :exit t)
        ("RET" ivy-done :exit t)
        ("C-m" ivy-done :exit t)
        ("f" ivy-call)
        ("c" ivy-toggle-calling)
        ("m" ivy-toggle-fuzzy)
        (">" ivy-minibuffer-grow)
        ("<" ivy-minibuffer-shrink)
        ("w" ivy-prev-action)
        ("s" ivy-next-action)
        ("a" ivy-read-action)
        ("t" (setq truncate-lines (not truncate-lines)))
        ("C" ivy-toggle-case-fold)
        ("o" ivy-occur :exit t)))
    
    
    ```
    
    Add a sort-by-length ivy sort functions that can later be used by different completion functions.
    
    ```elisp
    (defun my/ivy-sort-by-length (_name candidates)
      (-sort (lambda (f1 f2)
               (< (length f1) (length f2)))
             (copy-sequence candidates)))
    ```

2.  helm
