init.md

    Helm is the most well known narrowing completion framework for Emacs. It also has the largest amount of completion sources. Unfortunately it is no longer fully maintained, slower than ivy and somewhat intrusive.
    
    I personally load this package for some of it's additional sources, but do NOT enable `helm-mode`.
    
    ```elisp
    
    (use-package helm
      :straight t
      :defer t)
    
    (use-config helm
      ;; allow display settings to be overriden
      (setq helm-display-function 'pop-to-buffer))
    
    ```
    
    Just like with ivy an, albeit inferior, hydra is provided. Keys for accessing it in the helm buffer are bound.
    
    ```elisp
    
    (general-define-key
     :keymaps 'helm-map
     :states '(insert normal emacs visual)
     "C-o" 'hydra-helm/body)
    
    (use-config (hydra helm)
      (defhydra hydra-helm (:hint nil :color pink)
        "
                                                                              ╭──────┐
       Navigation   Other  Sources     Mark             Do             Help   │ Helm │
      ╭───────────────────────────────────────────────────────────────────────┴──────╯
            ^_k_^         _K_       _p_   [_m_] mark         [_v_] view         [_H_] helm help
            ^^↑^^         ^↑^       ^↑^   [_t_] toggle all   [_d_] delete       [_s_] source help
        _h_ ←   → _l_     _c_       ^ ^   [_u_] unmark all   [_f_] follow: %(helm-attr 'follow)
            ^^↓^^         ^↓^       ^↓^    ^ ^               [_y_] yank selection
            ^_j_^         _J_       _n_    ^ ^               [_w_] toggle windows
      --------------------------------------------------------------------------------
            "
        ("<tab>" helm-keyboard-quit "back" :exit t)
        ("<escape>" nil "quit")
        ("\\" (insert "\\") "\\" :color blue)
        ("h" helm-beginning-of-buffer)
        ("j" helm-next-line)
        ("k" helm-previous-line)
        ("l" helm-end-of-buffer)
        ("g" helm-beginning-of-buffer)
        ("G" helm-end-of-buffer)
        ("n" helm-next-source)
        ("p" helm-previous-source)
        ("K" helm-scroll-other-window-down)
        ("J" helm-scroll-other-window)
        ("c" helm-recenter-top-bottom-other-window)
        ("m" helm-toggle-visible-mark)
        ("t" helm-toggle-all-marks)
        ("u" helm-unmark-all)
        ("H" helm-help)
        ("s" helm-buffer-help)
        ("v" helm-execute-persistent-action)
        ("d" helm-persistent-delete-marked)
        ("y" helm-yank-selection)
        ("w" helm-toggle-resplit-and-swap-windows)
        ("f" helm-follow-mode)))
    
    ```

3.  hydra

    Hydra is a package that allows the end user or library authors to define keyboard-centric menus of arbitrary complexity. They may also define a doc-string which is then displayed as a formatted, visual presentation of the menu.
    
    ```elisp
    
    (use-package hydra
      :straight t)
    
    ```

4.  evil

    Evil is the extensible vi(m) layer for Emacs. It provides WORD vim emulation for Emacs, including motions, text objects visual, visual block and line selection, the vim command line, improved isearch [TODO fix ugly artefacts], interactive search and replace as well as ports of many popular vim extensions. Evil is activated through the global-only `evil-mode` and changes a huge amount of mappings. It also introduces the concept of states and intercept keymaps [TODO: understand this and then fix issues] which are fortunately handled relatively well by general.
    
    ```elisp
    
    (use-package evil
      :straight t
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (setq evil-want-minibuffer t)
      :config
      (evil-mode 1))
    
    (use-config evil
      (evil-select-search-module 'evil-search-module 'evil-search)
      (setq evil-ex-complete-emacs-commands t)
    
      (setq evil-cross-lines nil
            evil-move-beyond-eol nil
            evil-want-fine-undo t
            evil-symbol-word-search nil)
    
      (setq evil-motion-state-cursor 'box   ; █
            evil-visual-state-cursor 'box   ; █
            evil-normal-state-cursor 'box   ; █
            evil-insert-state-cursor 'bar   ; ⎸
            evil-emacs-state-cursor 'hbar)) ; _
    
    ```
    
    Evil-collection aims to bring the advantages of the vim modal editing model to many popular Emacs modes. It can sometimes be problematic, as it may override user-defined bindings.
    
    ```elisp
    
    (use-package evil-collection
      :straight t
      :init
      (setq evil-collection-setup-minibuffer t))
    
    ```
    
    Integration may be activated for a specific mode in the following fashion:
    
    ```elisp
    
    (require 'evil-collection-MODE)
    (evil-collection-MODE-setup)
    
    ```
    
    Where MODE is the mode to which you want to add the evil integration.
    
    As previously mentioned there exists a huge number of additional packages improving on evil-mode. I personally load quite a few of them myself.
    
    Evil surround and commentary emulate the popular vim plugins of the same name. They automatically bind their keys through `evil-surround-mode` and `evil-commentary-mode`.
    
    ```elisp
    
    (use-package evil-surround
      :straight t
      :after evil
      :config
      (global-evil-surround-mode 1))
    
    (use-package evil-commentary
      :straight t
      :after evil
      :config
      (evil-commentary-mode 1))
    
    ```
    
    [TODO: Evil multiedit or mc] [TODO: Evil terminal cursor]

5.  hippie-expand

    Hippie-expand provides expansion based on multiple different simultaneous sources. I don't use it often, but it can sometimes be nice to have.
    
    The default `hippie-expand` gets bound to `<C-y>` in insert and normal mode.
    
    ```elisp
    
    (use-package hippie-expand
      :defer t)
    
    (general-define-key
     :states '(normal insert)
     "C-y" 'hippie-expand)
    
    ```
