init.org
*** Prelude-esque
The [[https://github.com/bbatsov/prelude#helm][Emacs Prelude]] project, among other things, provides a set of helpful and generic keybindings for editing text.
I have extracted some of them for my own configuration.

There are bindings for operating on numbers, bound to the =C-c .= prefix.

#+begin_src elisp

(use-package operate-on-number
  :straight t)

(general-define-key
 :prefix "C-c ."
 "+" apply-operation-to-number-at-point
 "-" apply-operation-to-number-at-point
 "*" apply-operation-to-number-at-point
 "/" apply-operation-to-number-at-point
 "\\" apply-operation-to-number-at-point
 "^" apply-operation-to-number-at-point
 "<" apply-operation-to-number-at-point
 ">" apply-operation-to-number-at-point
 "#" apply-operation-to-number-at-point
 "%" apply-operation-to-number-at-point
 "'" operate-on-number-at-point)

#+end_src

*** Visual line
When I have enabled =visual-line-mode=, I want visual lines to be treated nearly the same as hard lines would be without it.
This means that some evil keys have to be rebound.
Note that motions that operate on lines such as for example "dd" still operate on hard lines.

#+begin_src elisp

(defun my/evil-visual-line-I ()
  (interactive)
  (evil-first-non-blank-of-visual-line)
  (evil-insert 1))

(defun my/evil-visual-line-A ()
  (interactive)
  (evil-end-of-visual-line)
  (evil-insert 1))

#+end_src
#+begin_src elisp

(general-define-key
 :states 'normal
 :keymaps 'visual-line-mode-map
 "j" 'evil-next-visual-line
 "k" 'evil-previous-visual-line
 "^" 'evil-first-non-blank-of-visual-line
 "$" 'evil-end-of-visual-line
 "I" 'evil-visual-line-I
 "A" "$a"
 "D" "d$"
 "C" "c$"
 "<down>" "j"
 "<up>" "k")

(general-define-key
 :states '(normal insert)
 :keymaps 'visual-line-mode-map
 "<down>" 'evil-next-visual-line
 "<up>" 'evil-previous-visual-line)

#+end_src

Visual-fill-column provides a =fill-column=-like experience for buffers using =visual-line-mode=.

#+begin_src elisp
(use-package visual-fill-column
  :straight t
  :hook (visual-line-mode . visual-fill-column-mode))
#+end_src

*** Pairs
While there are programming language specific packages that handle automatic pairing (eg. lispy) I would like to have this functionality for all programming languages as well as prose.
Smartparens has automatic detection for most programming and markup languages, as well as sensible defaults for unknown modes.

#+begin_src elisp

(use-package smartparens
  :straight t
  :requires smartparens-config
  :config
  (smartparens-global-mode))

#+end_src

Using lispy has also made me dependent the ability to slurp and barf sexps.
Bind keys to access that functionality in non-lisp buffers.

#+begin_src elisp

(general-define-key
 :states 'normal
 ">" 'sp-forward-slurp-sexp
 "<" 'sp-forward-barf-sexp)

#+end_src

For c-style languages, I would like to be able to automatically have braces indented for me. [TODO: Language handling]

#+begin_src elisp

(defun my/indent-between-braces (&rest _ignored)
  "Open a new brace or bracket expression, with relevant newlines and indent. "
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(sp-local-pair 'prog-mode "{" nil
               :post-handlers '((my/indent-between-braces "RET")))

#+end_src

Automatically highlight the pair opposite to the one at point.

#+begin_src elisp

(use-package paren
  :config
  (show-paren-mode))
  
#+end_src

*** Snippets
*** Jumping
** Programming
*** Defaults
This subtree contains sensible defaults for coding/writing.
Different major modes may override these.

Tabs are 4 spaces.
#+begin_src elisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
#+end_src

Never truncate lines. (May be overriden by =visual-line-mode=)
Custom-mode relies on truncating lines.
#+begin_src elisp
(setq-default truncate-lines t)
(add-hook 'custom-mode-hook (lambda () (setq-local truncate-lines nil)))
#+end_src

*** LSP/DAP family
Lsp-mode is a emacs package that handles talking to language servers supporting Microsofts open-source language server protocol.
It then provides several interfaces to the intelligent code information provided by these servers.
Some of the more generic interfaces are provided by the core lsp-mode package, while others reside in external packages such as lsp-ui and company-lsp.
Some languages may need additional packages for LSP support. These are managed in their respective subtrees.

#+begin_src elisp

(use-package lsp-mode
  :straight t
  :after projectile
  :commands lsp)

(use-package lsp-ui
  :straight t
  :after lsp-mode)

(use-package company-lsp
  :straight t
  :after (lsp-mode company yasnippet))

#+end_src

DAP is another protocol designed by Microsoft for its Visual Code editor. It functions similarly to the LSP, but is instead designed for debuggers.
Dap-mode for Emacs is also maintained by the emacs-lsp organization.
The project is currently in an early stage of development.

#+begin_src elisp

(use-package dap-mode
  :straight t
  :after lsp-mode)

#+end_src

LLDB support currently requires manual intervention. [TODO: LLDB for DAP]
