init.md


<a id="orgc148458"></a>

### Saving


<a id="org89b9ece"></a>

## Editing


<a id="org53925c0"></a>

### Prelude-esque

The [Emacs Prelude](https://github.com/bbatsov/prelude#helm) project, among other things, provides a set of helpful and generic keybindings for editing text. I have extracted some of them for my own configuration.

There are bindings for operating on numbers, bound to the `C-c .` prefix.

```elisp

(use-package operate-on-number
  :straight t)

(general-define-key
 :prefix "C-c ."
 "+" apply-operation-to-number-at-point
 "-" apply-operation-to-number-at-point
 "*" apply-operation-to-number-at-point
 "/" apply-operation-to-number-at-point
 "\\" apply-operation-to-number-at-point
 "^" apply-operation-to-number-at-point
 "<" apply-operation-to-number-at-point
 ">" apply-operation-to-number-at-point
 "#" apply-operation-to-number-at-point
 "%" apply-operation-to-number-at-point
 "'" operate-on-number-at-point)

```


<a id="org880f4af"></a>

### Visual line

When I have enabled `visual-line-mode`, I want visual lines to be treated nearly the same as hard lines would be without it. This means that some evil keys have to be rebound. Note that motions that operate on lines such as for example "dd" still operate on hard lines.

```elisp

(defun my/evil-visual-line-I ()
  (interactive)
  (evil-first-non-blank-of-visual-line)
  (evil-insert 1))

(defun my/evil-visual-line-A ()
  (interactive)
  (evil-end-of-visual-line)
  (evil-insert 1))

```

```elisp

(general-define-key
 :states 'normal
 :keymaps 'visual-line-mode-map
 "j" 'evil-next-visual-line
 "k" 'evil-previous-visual-line
 "^" 'evil-first-non-blank-of-visual-line
 "$" 'evil-end-of-visual-line
 "I" 'evil-visual-line-I
 "A" "$a"
 "D" "d$"
 "C" "c$"
 "<down>" "j"
 "<up>" "k")

(general-define-key
 :states '(normal insert)
 :keymaps 'visual-line-mode-map
 "<down>" 'evil-next-visual-line
 "<up>" 'evil-previous-visual-line)

```

Visual-fill-column provides a `fill-column`-like experience for buffers using `visual-line-mode`.

```elisp
(use-package visual-fill-column
  :straight t
  :hook (visual-line-mode . visual-fill-column-mode))
```


<a id="org804d99a"></a>

### Pairs

While there are programming language specific packages that handle automatic pairing (eg. lispy) I would like to have this functionality for all programming languages as well as prose. Smartparens has automatic detection for most programming and markup languages, as well as sensible defaults for unknown modes.

```elisp

(use-package smartparens
  :straight t
  :requires smartparens-config
  :config
  (smartparens-global-mode))

```

Using lispy has also made me dependent the ability to slurp and barf sexps. Bind keys to access that functionality in non-lisp buffers.

```elisp

(general-define-key
 :states 'normal
 ">" 'sp-forward-slurp-sexp
 "<" 'sp-forward-barf-sexp)

```

For c-style languages, I would like to be able to automatically have braces indented for me. [TODO: Language handling]

```elisp

(defun my/indent-between-braces (&rest _ignored)
  "Open a new brace or bracket expression, with relevant newlines and indent. "
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(sp-local-pair 'prog-mode "{" nil
               :post-handlers '((my/indent-between-braces "RET")))

```

Automatically highlight the pair opposite to the one at point.

```elisp

(use-package paren
  :config
  (show-paren-mode))

```


<a id="org8e34657"></a>

### Snippets


<a id="org04edb98"></a>

### Jumping


<a id="org9b6cb4a"></a>

## Programming


<a id="org88ab24e"></a>

### Defaults

This subtree contains sensible defaults for coding/writing. Different major modes may override these.

Tabs are 4 spaces.

```elisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
```

Never truncate lines. (May be overriden by `visual-line-mode`) Custom-mode relies on truncating lines.

```elisp
(setq-default truncate-lines t)
(add-hook 'custom-mode-hook (lambda () (setq-local truncate-lines nil)))
```


<a id="org31bcba5"></a>

### LSP/DAP family

Lsp-mode is a emacs package that handles talking to language servers supporting Microsofts open-source language server protocol. It then provides several interfaces to the intelligent code information provided by these servers. Some of the more generic interfaces are provided by the core lsp-mode package, while others reside in external packages such as lsp-ui and company-lsp. Some languages may need additional packages for LSP support. These are managed in their respective subtrees.

```elisp

(use-package lsp-mode
  :straight t
  :after projectile
  :commands lsp)

(use-package lsp-ui
  :straight t
  :after lsp-mode)

(use-package company-lsp
  :straight t
  :after (lsp-mode company yasnippet))

```

DAP is another protocol designed by Microsoft for its Visual Code editor. It functions similarly to the LSP, but is instead designed for debuggers. Dap-mode for Emacs is also maintained by the emacs-lsp organization. The project is currently in an early stage of development.

```elisp

(use-package dap-mode
  :straight t
  :after lsp-mode)

```

LLDB support currently requires manual intervention. [TODO: LLDB for DAP]
