org-init.el

;; [[file:~/.emacs.d/init.org::*Prelude-esque][Prelude-esque:1]]
(use-package operate-on-number
  :straight t)

(general-define-key
 :prefix "C-c ."
 "+" apply-operation-to-number-at-point
 "-" apply-operation-to-number-at-point
 "*" apply-operation-to-number-at-point
 "/" apply-operation-to-number-at-point
 "\\" apply-operation-to-number-at-point
 "^" apply-operation-to-number-at-point
 "<" apply-operation-to-number-at-point
 ">" apply-operation-to-number-at-point
 "#" apply-operation-to-number-at-point
 "%" apply-operation-to-number-at-point
 "'" operate-on-number-at-point)
;; Prelude-esque:1 ends here

;; [[file:~/.emacs.d/init.org::*Visual%20line][Visual line:1]]
(defun my/evil-visual-line-I ()
  (interactive)
  (evil-first-non-blank-of-visual-line)
  (evil-insert 1))

(defun my/evil-visual-line-A ()
  (interactive)
  (evil-end-of-visual-line)
  (evil-insert 1))
;; Visual line:1 ends here

;; [[file:~/.emacs.d/init.org::*Visual%20line][Visual line:2]]
(general-define-key
 :states 'normal
 :keymaps 'visual-line-mode-map
 "j" 'evil-next-visual-line
 "k" 'evil-previous-visual-line
 "^" 'evil-first-non-blank-of-visual-line
 "$" 'evil-end-of-visual-line
 "I" 'evil-visual-line-I
 "A" "$a"
 "D" "d$"
 "C" "c$"
 "<down>" "j"
 "<up>" "k")

(general-define-key
 :states '(normal insert)
 :keymaps 'visual-line-mode-map
 "<down>" 'evil-next-visual-line
 "<up>" 'evil-previous-visual-line)
;; Visual line:2 ends here

;; [[file:~/.emacs.d/init.org::*Visual%20line][Visual line:3]]
(use-package visual-fill-column
  :straight t
  :hook (visual-line-mode . visual-fill-column-mode))
;; Visual line:3 ends here

;; [[file:~/.emacs.d/init.org::*Pairs][Pairs:1]]
(use-package smartparens
  :straight t
  :requires smartparens-config
  :config
  (smartparens-global-mode))
;; Pairs:1 ends here

;; [[file:~/.emacs.d/init.org::*Pairs][Pairs:2]]
(general-define-key
 :states 'normal
 ">" 'sp-forward-slurp-sexp
 "<" 'sp-forward-barf-sexp)
;; Pairs:2 ends here

;; [[file:~/.emacs.d/init.org::*Pairs][Pairs:3]]
(defun my/indent-between-braces (&rest _ignored)
  "Open a new brace or bracket expression, with relevant newlines and indent. "
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(sp-local-pair 'prog-mode "{" nil
               :post-handlers '((my/indent-between-braces "RET")))
;; Pairs:3 ends here

;; [[file:~/.emacs.d/init.org::*Pairs][Pairs:4]]
(use-package paren
  :config
  (show-paren-mode))
;; Pairs:4 ends here

;; [[file:~/.emacs.d/init.org::*Defaults][Defaults:1]]
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
;; Defaults:1 ends here

;; [[file:~/.emacs.d/init.org::*Defaults][Defaults:2]]
(setq-default truncate-lines t)
(add-hook 'custom-mode-hook (lambda () (setq-local truncate-lines nil)))
;; Defaults:2 ends here

;; [[file:~/.emacs.d/init.org::*LSP/DAP%20family][LSP/DAP family:1]]
(use-package lsp-mode
  :straight t
  :after projectile
  :commands lsp)

(use-package lsp-ui
  :straight t
  :after lsp-mode)

(use-package company-lsp
  :straight t
  :after (lsp-mode company yasnippet))
;; LSP/DAP family:1 ends here

;; [[file:~/.emacs.d/init.org::*LSP/DAP%20family][LSP/DAP family:2]]
(use-package dap-mode
  :straight t
  :after lsp-mode)
;; LSP/DAP family:2 ends here
