init.org
*** Projectile
Projectile is the de-facto standard project management library for emacs.
It has support for detecting most VC and build systems by default but can be customized further to fit specific workflows.

While projectile has a great user-facing API, some packages in the Emacs ecosystem also call into the library for context on the currently edited projects. (eg. LSP)

Projectile heavily relies on completion for its user-facing API and has builtin support for all NCFs through completion-in-region. Moreover there also exist some packages with additional user commands, optimized for the use with specific NCFs. I prefer ivy and counsel-projectile.

#+begin_src elisp

(use-package projectile
  :straight t
  :config
  (projectile-mode 1))

(use-package counsel-projectile
  :straight t
  :after (projectile counsel)
  :config
  (counsel-projectile-mode))

(use-config projectile
  (setq projectile-completion-system 'ivy))

#+end_src

As previously mentioned, projectile has great support for automatically finding projects based on VC and/or build-root files. It also handles nested repositories.
However I mostly find these features to be annoying for actual day-to-day use.
Therefore I configure projectile to
1) only detect some common VC systems
2) only index the first project and not care about nesting

#+begin_src elisp

(use-config projectile
  (setq projectile-project-root-files-functions '(projectile-root-top-down))
  (setq projectile-project-root-files
        '(".git" ".bzr" ".svn" ".hg" "_darcs" ".projectile"))) 

#+end_src

*** Company
Company is the most popular replacement for Emacs' built in auto-complete library and the de-facto default solution for autocompletion in Emacs.
Its main selling points include the ability to perform asynchronous completion and its separation into completion front- and backends.
Some company sources also provide parameter expansion using the yasnippet minor mode.
Other packages may define arbitrary completion backends for company. These are managed in their respective subtrees.

Company is automatically enabled in all programming buffers. Yasnippet is needed for parameter expansion.

#+begin_src elisp

(use-package company
  :straight t
  :defer t
  :hook ((prog-mode . company-mode)
         (company-mode . yas-minor-mode)))

#+end_src

Misc company setting, mostly related to frontend display. [TODO: set best frontends]

#+begin_src elisp

(use-config company
  (setq company-minimum-prefix-length 1)
  (setq company-idle-delay 0.2)
  (setq company-dabbrev-downcase nil)
  (setq company-require-match nil)
  (setq company-tooltip-align-annotations t)
  (setq company-frontends '(company-tng-frontend
                            company-pseudo-tooltip-frontend
                            company-echo-metadata-frontend)))

#+end_src

*** Outline/shine
Outline is a library for structuring files using nested headings that can be folded. It is most famously used by the org-mode extension.

Outshine is a package that promises to bring the advantages of structuring your files with outline to all programming languages.

I personally only use it for Elisp and would like to remove it as soon as possible, because it is very unstable and requires intrusive hacks in order to work properly.

#+begin_src elisp
(use-package outshine
  :straight t
  :after org
  :add-hook (emacs-lisp-mode . outshine-mode))
#+end_src

#+begin_src elisp

(defun my/outshine-smart-tab ()
  (interactive)
  (if (outline-on-heading-p)
      (outshine-cycle)
    (indent-for-tab-command)))

;; terrible hack to keep font-lock after reload
(use-config outshine
  (ignore-errors
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (if (bound-and-true-p outshine-mode)
            (font-lock-add-keywords nil (outshine-fontify-headlines (outshine-calc-outline-regexp)))
          (outshine-font-lock-flush))))))

;; use same colors as org-mode
(use-config outshine
  (set-face-attribute 'outshine-level-1 nil :inherit 'org-level-1 :height 100)
  (set-face-attribute 'outshine-level-2 nil :inherit 'org-level-2 :height 100)
  (set-face-attribute 'outshine-level-3 nil :inherit 'org-level-3 :height 100)
  (set-face-attribute 'outshine-level-4 nil :inherit 'org-level-4)
  (set-face-attribute 'outshine-level-5 nil :inherit 'org-level-5)
  (set-face-attribute 'outshine-level-6 nil :inherit 'org-level-6)
  (set-face-attribute 'outshine-level-7 nil :inherit 'org-level-7)
  (set-face-attribute 'outshine-level-8 nil :inherit 'org-level-8))

#+end_src

*** Flycheck
*** Fly/ispell
Ispell is the most common spell checking utility on unix-like systems.
Emacs ispell offers integration with the program by calling it on some, usually a buffers, text and then walking through all reported errors.

#+begin_src elisp
(use-package ispell
  :defer t)
#+end_src

Flyspell offers more traditional "red underline" spell-checking using Emacs ispell as its backend.

#+begin_src elisp
(use-package flyspell
  :straight t
  :defer t)
#+end_src

The command used for spell checking can be changed. I personally use hunspell, which has better support for some languages and is also used by the LibreOffice project.

#+begin_src elisp
(setq ispell-program-name "hunspell")
#+end_src

**** Dictionaries
The language to spell-check for will usually be set as a file-local variable.
If not, default to "en_US".

#+begin_src elisp
(setq ispell-dictionary "en_US")
(setq flyspell-default-dictionary "en_US")
#+end_src

Using ispell with hunspell requires some additional setup to correctly handle dictionaries.

#+begin_src elisp

(setq ispell-dictionary-alist
      `(("en_US")
        ("de_AT")
        ("en_US,de_AT")))

(dolist (dict ispell-dictionary-alist)
  (ispell-hunspell-fill-dictionary-entry (car dict)))

#+end_src

** Languages
