org-init.el

;; [[file:~/.emacs.d/init.org::*Projectile][Projectile:1]]
(use-package projectile
  :straight t
  :config
  (projectile-mode 1))

(use-package counsel-projectile
  :straight t
  :after (projectile counsel)
  :config
  (counsel-projectile-mode))

(use-config projectile
  (setq projectile-completion-system 'ivy))
;; Projectile:1 ends here

;; [[file:~/.emacs.d/init.org::*Projectile][Projectile:2]]
(use-config projectile
  (setq projectile-project-root-files-functions '(projectile-root-top-down))
  (setq projectile-project-root-files
        '(".git" ".bzr" ".svn" ".hg" "_darcs" ".projectile")))
;; Projectile:2 ends here

;; [[file:~/.emacs.d/init.org::*Company][Company:1]]
(use-package company
  :straight t
  :defer t
  :hook ((prog-mode . company-mode)
         (company-mode . yas-minor-mode)))
;; Company:1 ends here

;; [[file:~/.emacs.d/init.org::*Company][Company:2]]
(use-config company
  (setq company-minimum-prefix-length 1)
  (setq company-idle-delay 0.2)
  (setq company-dabbrev-downcase nil)
  (setq company-require-match nil)
  (setq company-tooltip-align-annotations t)
  (setq company-frontends '(company-tng-frontend
                            company-pseudo-tooltip-frontend
                            company-echo-metadata-frontend)))
;; Company:2 ends here

;; [[file:~/.emacs.d/init.org::*Outline/shine][Outline/shine:1]]
(use-package outshine
  :straight t
  :after org
  :add-hook (emacs-lisp-mode . outshine-mode))
;; Outline/shine:1 ends here

;; [[file:~/.emacs.d/init.org::*Outline/shine][Outline/shine:2]]
(defun my/outshine-smart-tab ()
  (interactive)
  (if (outline-on-heading-p)
      (outshine-cycle)
    (indent-for-tab-command)))

;; terrible hack to keep font-lock after reload
(use-config outshine
  (ignore-errors
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (if (bound-and-true-p outshine-mode)
            (font-lock-add-keywords nil (outshine-fontify-headlines (outshine-calc-outline-regexp)))
          (outshine-font-lock-flush))))))

;; use same colors as org-mode
(use-config outshine
  (set-face-attribute 'outshine-level-1 nil :inherit 'org-level-1 :height 100)
  (set-face-attribute 'outshine-level-2 nil :inherit 'org-level-2 :height 100)
  (set-face-attribute 'outshine-level-3 nil :inherit 'org-level-3 :height 100)
  (set-face-attribute 'outshine-level-4 nil :inherit 'org-level-4)
  (set-face-attribute 'outshine-level-5 nil :inherit 'org-level-5)
  (set-face-attribute 'outshine-level-6 nil :inherit 'org-level-6)
  (set-face-attribute 'outshine-level-7 nil :inherit 'org-level-7)
  (set-face-attribute 'outshine-level-8 nil :inherit 'org-level-8))
;; Outline/shine:2 ends here

;; [[file:~/.emacs.d/init.org::*Fly/ispell][Fly/ispell:1]]
(use-package ispell
  :defer t)
;; Fly/ispell:1 ends here

;; [[file:~/.emacs.d/init.org::*Fly/ispell][Fly/ispell:2]]
(use-package flyspell
  :straight t
  :defer t)
;; Fly/ispell:2 ends here

;; [[file:~/.emacs.d/init.org::*Fly/ispell][Fly/ispell:3]]
(setq ispell-program-name "hunspell")
;; Fly/ispell:3 ends here

;; [[file:~/.emacs.d/init.org::*Dictionaries][Dictionaries:1]]
(setq ispell-dictionary "en_US")
(setq flyspell-default-dictionary "en_US")
;; Dictionaries:1 ends here

;; [[file:~/.emacs.d/init.org::*Dictionaries][Dictionaries:2]]
(setq ispell-dictionary-alist
      `(("en_US")
        ("de_AT")
        ("en_US,de_AT")))

(dolist (dict ispell-dictionary-alist)
  (ispell-hunspell-fill-dictionary-entry (car dict)))
;; Dictionaries:2 ends here
