init.org
*** Emacs Lisp
Emacs Lisp is a Lisp dialect used mainly as a scripting and configuration language for GNU Emacs and most other Emacs variants.

As Emacs Lisp is the only Lisp dialect I regularly use, this subtree also contains settings that affect general Lisp editing.

Lispy is a package that provides an improved Lisp editing experience.
It is a spiritual sucessor to the popular paredit.

#+begin_src elisp
(use-package lispy
  :straight t
  :defer t
  :hook (emacs-lisp-mode . lispy-mode))
#+end_src

Aggressive-indent automatically updates indentation after every keystroke, for instant visual feedback.
This is especially useful for Lisp, where most code structure is determined by indentation.

#+begin_src elisp
(use-package aggressive-indent
  :straight t
  :defer t
  :hook (lispy-mode . aggressive-indent-mode))
#+end_src

*** Haskell
Haskell is a statically typed, /"purely functional"/ general-purpose programming language.

*** Nix
Nix is a functional-style programming language that can be used for package management through the Nix package manager as well as for system configuration through the NixOS project.

NixOS is my preferred GNU/Linux distribution for desktop and server use.
Most of my systems currently run it.

The Nix project also provides an Emacs major mode for working with the Nix language.

#+begin_src elisp
(use-package nix-mode
  :straight t
  :defer t
  :mode "\\.nix\\'")
#+end_src

*** TeX/LaTeX
TeX is a typesetting system developed mainly by Donald Knuth.
LaTeX is the most popular macro collection for TeX. It can be customized further through additional packages.

AucTeX is a popular Emacs extension that majorly improves the editing of TeX files and also provides various other TeX related utilities.

#+begin_src elisp

(use-package tex
  :straight auctex
  :defer t
  :hook
  (TeX-mode . visual-line-mode)
  (LaTeX-mode . visual-line-mode)
  :config
  (TeX-source-correlate-mode)
  (TeX-PDF-mode))

#+end_src

Set Zathura as the default pdf viewer for tex. This also allows using source-correlate through SyncTeX.

#+begin_src elisp
(add-to-list 'TeX-view-program-selection
             '(output-pdf "Zathura"))

(add-to-list 'TeX-expand-list
             '("%sn" (lambda () server-name)))

(add-to-list 'TeX-view-program-list
             '("Zathura"
               ("zathura %o"
                (mode-io-correlate " --synctex-forward %n:0:%b -x \"emacsclient --socket-name=%sn --no-wait +%{line} %{input}\""))
               "zathura")))
#+end_src

*** Markdown
Markdown is a generally well supported loose standard for rich text formatting.

Markdown-mode provides a mode for editing generic Markdown files as well as another for the customized variant supported by Github.

#+begin_src elisp
(use-package markdown-mode
  :straight t
  :defer t
  :hook (markdown-mode . visual-line-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "markdown"))
#+end_src

*** Python
Python is an easy to understand, duck-typed general purpose scripting and programming language.

I just use it for basic scripting, so the builtin python-mode is sufficient for now.

*** Rust
Rust is a modern statically typed systems programming language with support for many high-level concepts currently backed by Mozilla.

The Rust major mode adds basic highlighting and indentation support for the Rust language, flycheck-rust offers Flycheck integration for =cargo check= rls and clippy.

#+begin_src elisp

(use-package rust-mode
  :straight t
  :mode "\\.rs\\'") ;; this is already done by rust-mode

(use-package flycheck-rust
  :straight t
  :after rust-mode
  :hook (rust-mode . flycheck-rust-setup))

(use-package cargo
  :straight t
  :after rust-mode
  :hook (rust-mode . cargo-minor-mode))

#+end_src

The Rust Language Server as well as Flycheck need some specific environment variables to be set in order to work correctly.
Set them after the first call to =rust-mode-hook=.

#+begin_src elisp

(defun my/setup-rust-env ()
  "RLS requires some environment variables to be setup. We use rustup to get the values."
  (when (executable-find "rustup")
    (setq rust-default-toolchain
          ;; [TODO: s.el]
          (car (s-split " " (-first
                             (lambda (line) (s-match "default" line)) 
                             (s-lines (shell-command-to-string "rustup toolchain list"))))))
    ;; tell racer to use the rustup-managed rust-src
    ;; rustup component add rust-src
    (setq rust-src-path (f-join (getenv "HOME") ".multirust/toolchains" rust-default-toolchain "lib/rustlib/src/rust/src"))
    (setq rust-bin-path (f-join (getenv "HOME") ".multirust/toolchains" rust-default-toolchain "bin"))
    (setq racer-rust-src-path rust-src-path)
    (setenv "RUST_SRC_PATH" rust-src-path)
    (setenv "RUSTC" rust-bin-path))
  ;; only call once
  (remove-hook 'rust-mode-hook 'my/setup-rust-env))

(add-hook 'rust-mode-hook 'my/setup-rust-env)

#+end_src

*** Shell
** Misc
*** Git/Magit
Git is the most common VC system today.
Most open-source project use it, partly because of its great hosting support with Github and Gitlab providing near-unlimited public storage.

Magit is an intuitive and comprehensive graphical interface to the git CLI.
It is widely considered the best currently existing git client.

#+begin_src elisp
(use-package magit
  :straight t
  :defer t)
#+end_src

More recently Magit also gained support for working with git forges through the additional "forge" package.
In order to correctly install and use magit-forge, you will need to have a C compiler (eg. gcc) when first running any forge command. [TODO: this is suboptimal]

#+begin_src elisp
(use-package forge
  :straight (forge :host github :repo "magit/forge")
  :after magit)
#+end_src

