org-init.el

;; [[file:~/.emacs.d/init.org::*Emacs%20Lisp][Emacs Lisp:1]]
(use-package lispy
  :straight t
  :defer t
  :hook (emacs-lisp-mode . lispy-mode))
;; Emacs Lisp:1 ends here

;; [[file:~/.emacs.d/init.org::*Emacs%20Lisp][Emacs Lisp:2]]
(use-package aggressive-indent
  :straight t
  :defer t
  :hook (lispy-mode . aggressive-indent-mode))
;; Emacs Lisp:2 ends here

;; [[file:~/.emacs.d/init.org::*Nix][Nix:1]]
(use-package nix-mode
  :straight t
  :defer t
  :mode "\\.nix\\'")
;; Nix:1 ends here

;; [[file:~/.emacs.d/init.org::*TeX/LaTeX][TeX/LaTeX:1]]
(use-package tex
  :straight auctex
  :defer t
  :hook
  (TeX-mode . visual-line-mode)
  (LaTeX-mode . visual-line-mode)
  :config
  (TeX-source-correlate-mode)
  (TeX-PDF-mode))
;; TeX/LaTeX:1 ends here

;; [[file:~/.emacs.d/init.org::*TeX/LaTeX][TeX/LaTeX:2]]
(add-to-list 'TeX-view-program-selection
             '(output-pdf "Zathura"))

(add-to-list 'TeX-expand-list
             '("%sn" (lambda () server-name)))

(add-to-list 'TeX-view-program-list
             '("Zathura"
               ("zathura %o"
                (mode-io-correlate " --synctex-forward %n:0:%b -x \"emacsclient --socket-name=%sn --no-wait +%{line} %{input}\""))
               "zathura")))
;; TeX/LaTeX:2 ends here

;; [[file:~/.emacs.d/init.org::*Markdown][Markdown:1]]
(use-package markdown-mode
  :straight t
  :defer t
  :hook (markdown-mode . visual-line-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "markdown"))
;; Markdown:1 ends here

;; [[file:~/.emacs.d/init.org::*Rust][Rust:1]]
(use-package rust-mode
  :straight t
  :mode "\\.rs\\'") ;; this is already done by rust-mode

(use-package flycheck-rust
  :straight t
  :after rust-mode
  :hook (rust-mode . flycheck-rust-setup))

(use-package cargo
  :straight t
  :after rust-mode
  :hook (rust-mode . cargo-minor-mode))
;; Rust:1 ends here

;; [[file:~/.emacs.d/init.org::*Rust][Rust:2]]
(defun my/setup-rust-env ()
  "RLS requires some environment variables to be setup. We use rustup to get the values."
  (when (executable-find "rustup")
    (setq rust-default-toolchain
          ;; [TODO: s.el]
          (car (s-split " " (-first
                             (lambda (line) (s-match "default" line)) 
                             (s-lines (shell-command-to-string "rustup toolchain list"))))))
    ;; tell racer to use the rustup-managed rust-src
    ;; rustup component add rust-src
    (setq rust-src-path (f-join (getenv "HOME") ".multirust/toolchains" rust-default-toolchain "lib/rustlib/src/rust/src"))
    (setq rust-bin-path (f-join (getenv "HOME") ".multirust/toolchains" rust-default-toolchain "bin"))
    (setq racer-rust-src-path rust-src-path)
    (setenv "RUST_SRC_PATH" rust-src-path)
    (setenv "RUSTC" rust-bin-path))
  ;; only call once
  (remove-hook 'rust-mode-hook 'my/setup-rust-env))

(add-hook 'rust-mode-hook 'my/setup-rust-env)
;; Rust:2 ends here

;; [[file:~/.emacs.d/init.org::*Git/Magit][Git/Magit:1]]
(use-package magit
  :straight t
  :defer t)
;; Git/Magit:1 ends here

;; [[file:~/.emacs.d/init.org::*Git/Magit][Git/Magit:2]]
(use-package forge
  :straight (forge :host github :repo "magit/forge")
  :after magit)
;; Git/Magit:2 ends here
