init.md


<a id="orgca59335"></a>

### Music/MPD

MPD is an daemon for playing music. Many frontends for the MPD server exist, I use ncmpcpp for terminal and mpdel for Emacs. There's also ivy-mpdel which allows for using the ivy NCS to select songs.

```elisp

(use-package mpdel
  :straight t
  :defer t)

(use-package ivy-mpdel
  :straight t
  :after mpdel)

```


<a id="org519a6fb"></a>

### Mail

1.  Message

2.  Notmuch


<a id="org11359b7"></a>

### Org

Org is a system for keeping easily navigable plain text notes, lists, and structured documents. It also features literate programming support through org-babel, which this document uses for exporting, a customizable agenda, the ability to easily capture arbitrary text without interrupting your workflow and a large amount of export backends, ranging from LaTeX documents to complex static webpages. There exist a huge amount of extensions to the Org system which can be loaded as normal Emacs packages from repositories such as MELPA or ELPA. I have also written one of my own, [org-pretty-jump](straight/repos/org-pretty-jump/).

In no particular order, these are some of the things I use:

-   Easy buffer navigation and editing
    -   org-tempo (builtin but not loaded by default)
    -   worf
    -   org-pretty-jump goto
    -   custom keybindings
-   Authoring notes
    -   TODO keywords and states
    -   org-capture
        -   org-protocol
        -   org-pretty-jump capture
    -   org-agenda
    -   refile
        -   org-pretty-jump refile
-   Writing papers/articles
    -   org-ref
    -   export to LaTeX
        -   Bib(La)TeX support
-   Writing documentation
    -   Github support (eg. README.org)
    -   export to static page
-   Literate programming
    -   org-babel
        -   tangle
        -   in-buffer evaluation

Officially load the org-plus-contrib package and also require some optional packages.

```elisp
(use-package org
  :straight org-plus-contrib
  :requires (org-capture org-protocol))
```

1.  Personal

    These are the personal settings I need for managing my notes on my system. Even if you want to copy some of my settings, you will almost definitely want to change these.
    
    ```elisp
    (setq org-default-notes-file "~/Projects/notes.org")
    (setq org-todo-keywords
          '((sequence "TODO" "DOING" "|" "DONE BUT" "DONE")
            (sequence "MAYBE" "CANCELED" "|")
    ```
    
    1.  Link types
    
        These are my custom org-link-types.
        
        ```elisp
        (use-config org
          (org-add-link-type
           "project" 'projectile-switch-project-by-name))
        ```
    
    2.  Capture templates
    
        These are my custom org-capture templates. Probably only "g - Generic" stands out. It uses org-pretty-jump to capture to an arbitrary subtree in my `org-default-notes-file`. "L - Protocol Link" and "p - Protocol Selection" are used by org-protocol and the org-capture firefox extension.
        
        ```elisp
        (setq org-capture-templates
              '(("g" "Generic" entry
                 ;; [TODO: make this work]
                 (file+function "" (lambda ()
                                     (goto-char (opj/get-pos t))))
                 "* %?%i")
                ("t" "Task" entry (file+headline org-default-notes-file "Tasks")
                 "* TODO %?\n  %i\n")
                ("i" "Idea" entry (file+headline org-default-notes-file "Ideas")
                 "* %?")
                ("L" "Protocol Link" entry (file+headline org-default-notes-file "Weblinks")
                 "* %:description%?\n[[%:link]]\n%t"
                 :immediate-finish t)
                ("p" "Protocol Selection" entry (file+headline org-default-notes-file "Weblinks")
                 "* %:description\n[[%:link]]\n%t\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n%?")))
        ```

2.  Buffer
