org-init.el

;; [[file:~/.emacs.d/init.org::*Music/MPD][Music/MPD:1]]
(use-package mpdel
  :straight t
  :defer t)

(use-package ivy-mpdel
  :straight t
  :after mpdel)
;; Music/MPD:1 ends here

;; [[file:~/.emacs.d/init.org::*Org][Org:1]]
(use-package org
  :straight org-plus-contrib
  :requires (org-capture org-protocol))
;; Org:1 ends here

;; [[file:~/.emacs.d/init.org::*Personal][Personal:1]]
(setq org-default-notes-file "~/Projects/notes.org")
(setq org-todo-keywords
      '((sequence "TODO" "DOING" "|" "DONE BUT" "DONE")
        (sequence "MAYBE" "CANCELED" "|")
;; Personal:1 ends here

;; [[file:~/.emacs.d/init.org::*Link%20types][Link types:1]]
(use-config org
  (org-add-link-type
   "project" 'projectile-switch-project-by-name))
;; Link types:1 ends here

;; [[file:~/.emacs.d/init.org::*Capture%20templates][Capture templates:1]]
(setq org-capture-templates
      '(("g" "Generic" entry
         ;; [TODO: make this work]
         (file+function "" (lambda ()
                             (goto-char (opj/get-pos t))))
         "* %?%i")
        ("t" "Task" entry (file+headline org-default-notes-file "Tasks")
         "* TODO %?\n  %i\n")
        ("i" "Idea" entry (file+headline org-default-notes-file "Ideas")
         "* %?")
        ("L" "Protocol Link" entry (file+headline org-default-notes-file "Weblinks")
         "* %:description%?\n[[%:link]]\n%t"
         :immediate-finish t)
        ("p" "Protocol Selection" entry (file+headline org-default-notes-file "Weblinks")
         "* %:description\n[[%:link]]\n%t\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n%?")))
;; Capture templates:1 ends here
