init.org
**** Buffer
In order to use org-mode effectively it is important to be able to comfortably manage your .org files and buffers.
I personally enjoy easy to access DWIM keys and menus over having to memorize a large amount of keybindings.
Some of these I have created myself, some are provided by Org.

I enjoy writing prose in visual line mode. Add the required hook here.
#+begin_src elisp
(add-hook 'org-mode-hook 'visual-line-mode)
#+end_src

As of Org 9.2 "org-tempo" is no longer loaded by default. It allows for easy insertion of code blocks through contextual binding like =<s|<TAB>=.
Load it here.
#+begin_src elisp
(load-library "org-tempo")
#+end_src

Navigating huge Org buffers can be difficult, org-pretty-jump tries to make that task easier by providing a good-looking ivy-based menu that can be used to jump to any headline.
It also provides some additional functions for common Org task such as refiling as well as an easy to understand API for creating custom actions using the central menu.
#+begin_src elisp
(use-package org-pretty-jump
  :straight (org-pretty-jump :type git :host github
                             :repo "LeOtaku/org-pretty-jump")
  :after org)
#+end_src

#+RESULTS:

Do not adapt indentation by inserting whitespace. This is better handled by =org-indent-mode=.
#+begin_src elisp
(setq org-adapt-indentation nil)
#+end_src

Org mode already has great highlighting for most important syntax, some common constructs seem to be missing.
This includes both =@@key: text@@= style inline markup, as well as list items.
Additionally I personally enjoy using the =->= symbol in my notes to signal causation, so I would like to see that highlighted.
Add the required entries here.

#+begin_src elisp

(use-config org-mode
  (setq my/org-list-font-locks
        '(("^ *\\([0-9]+\\.\\)" (1 'bold))
          ("^ *\\([0-9]+)\\)" (1 'bold))
          ("^ *\\([+-]\\)" (1 'bold))
          ("^ +\\([*]\\)" (1 'bold))))
  
  (setq my/org-misc-font-locks
        '(("\\(->\\)" (1 'bold))
          ("\\(@\\)" (1 'org-meta-line))))

  (font-lock-add-keywords 'org-mode (concat
                                     my/org-misc-font-locks
                                     my/org-list-font-locks)))

#+end_src

Moreover, I would like highlighting for some additional TODO states.

#+begin_src elisp

;; [TODO: ensure this works]
(defface org-canceled '(:color red) "")
(defface org-maybe    '(:color magenta) "")

(setq org-todo-keyword-faces
      '(("TODO"      . 'org-todo)
        ("DOING"     . 'org-todo)
        ("DONE BUT"  . 'org-done)
        ("DONE"      . 'org-done)
        ("MAYBE"     . 'org-maybe)
        ("PLANNED"   . 'org-maybe)
        ("CANCELED"  . 'org-canceled)
        ("DROPPED"   . 'org-canceled)))

#+end_src

Lastly, lets display images by default, but make sure they get scaled sensibly.

#+begin_src elisp
(setq org-image-actual-width 400)
(setq org-startup-with-inline-images t)
#+end_src

**** Links
Custom link types live in =Personal/Link Types=.
These are other link-related settings not specific to my personal setup.

Always link files relatively if possible.
#+begin_src elisp
(setq org-link-file-path-type 'relative)
#+end_src

Always show the shortest candidate first when completing link-types.
#+begin_src elisp
(add-to-list 'ivy-sort-matches-functions-alist
             '(org-insert-link . my/ivy-sort-by-length)
             t)
#+end_src

**** Capture
Capture templates live in =Personal/Capture Templates=.
These are other capture-related settings not specific to my personal setup.

#+begin_src elisp
(use-config (org-capture evil)
  (add-hook 'org-capture-mode-hook (lambda () (evil-append 1))))
#+end_src

**** Export
The org ecosystem offers many different export backends for a wide range of usecases.

I mainly use the following exporters:
+ LaTeX :: writing documents
+ Hugo :: webpages using the gohugo static site generator
+ Plaintext :: email

These can be accessed using the default =C-c C-e= binding provided by org mode.

Set the LaTeX backend to export to pdf using the =latexmk= utility.
#+begin_src elisp
(use-config org
  (setq org-latex-pdf-process
        (list "latexmk -interaction=nonstopmode -output-directory=%o -shell-escape -bibtex -f -pdf %f")))
#+end_src

Load and configure the external backends.
#+begin_src elisp

(use-package ox-hugo
  :straight t)

#+end_src

