org-init.el

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:1]]
(add-hook 'org-mode-hook 'visual-line-mode)
;; Buffer:1 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:2]]
(load-library "org-tempo")
;; Buffer:2 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:3]]
(use-package org-pretty-jump
  :straight (org-pretty-jump :type git :host github
                             :repo "LeOtaku/org-pretty-jump")
  :after org)
;; Buffer:3 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:4]]
(setq org-adapt-indentation nil)
;; Buffer:4 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:5]]
(use-config org-mode
  (setq my/org-list-font-locks
        '(("^ *\\([0-9]+\\.\\)" (1 'bold))
          ("^ *\\([0-9]+)\\)" (1 'bold))
          ("^ *\\([+-]\\)" (1 'bold))
          ("^ +\\([*]\\)" (1 'bold))))
  
  (setq my/org-misc-font-locks
        '(("\\(->\\)" (1 'bold))
          ("\\(@\\)" (1 'org-meta-line))))

  (font-lock-add-keywords 'org-mode (concat
                                     my/org-misc-font-locks
                                     my/org-list-font-locks)))
;; Buffer:5 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:6]]
;; [TODO: ensure this works]
(defface org-canceled '(:color red) "")
(defface org-maybe    '(:color magenta) "")

(setq org-todo-keyword-faces
      '(("TODO"      . 'org-todo)
        ("DOING"     . 'org-todo)
        ("DONE BUT"  . 'org-done)
        ("DONE"      . 'org-done)
        ("MAYBE"     . 'org-maybe)
        ("PLANNED"   . 'org-maybe)
        ("CANCELED"  . 'org-canceled)
        ("DROPPED"   . 'org-canceled)))
;; Buffer:6 ends here

;; [[file:~/.emacs.d/init.org::*Buffer][Buffer:7]]
(setq org-image-actual-width 400)
(setq org-startup-with-inline-images t)
;; Buffer:7 ends here

;; [[file:~/.emacs.d/init.org::*Links][Links:1]]
(setq org-link-file-path-type 'relative)
;; Links:1 ends here

;; [[file:~/.emacs.d/init.org::*Links][Links:2]]
(add-to-list 'ivy-sort-matches-functions-alist
             '(org-insert-link . my/ivy-sort-by-length)
             t)
;; Links:2 ends here

;; [[file:~/.emacs.d/init.org::*Capture][Capture:1]]
(use-config (org-capture evil)
  (add-hook 'org-capture-mode-hook (lambda () (evil-append 1))))
;; Capture:1 ends here

;; [[file:~/.emacs.d/init.org::*Export][Export:1]]
(use-config org
  (setq org-latex-pdf-process
        (list "latexmk -interaction=nonstopmode -output-directory=%o -shell-escape -bibtex -f -pdf %f")))
;; Export:1 ends here

;; [[file:~/.emacs.d/init.org::*Export][Export:2]]
(use-package ox-hugo
  :straight t)
;; Export:2 ends here
