init.md

    Org ref is a package that makes it easy to work with Bib(La)TeX bibliographies in .org buffers and files. It, among other things, provides easy access to ref/cite/label links using either helm or ivy, in-buffer error reporting and automatic link resolution for exports. It may also be used in conjunction with the ivy/helm-bibtex packages.
    
    ```elisp
    
    (use-package org-ref
      :straight t
      :after (org ivy-bibtex)
      :requires (doi-utils org-ref-isbn org-ref-ivy org-ref-helm)
      :init
      (setq org-ref-completion-library 'org-ref-ivy-cite))
    
    ```
    
    The uppercase versions of BibTeX links defined by org-ref clutter the insert link menu while not having any apparent use. Remove them for now. [TODO: test this]
    
    ```elisp
    
    (setq org-ref-biblatex-types
      '(;; "Cite"
        "parencite" ;; "Parencite"
        "footcite" "footcitetext"
        "textcite"  ;; "Textcite"
        "smartcite" ;; "Smartcite"
        "cite*" "parencite*" "supercite"
        "autocite"  ;; "Autocite"
        "autocite*" ;; "Autocite*"
        ;; "Citeauthor*"
        "citetitle" "citetitle*"
        "citedate" "citedate*"
        "citeurl"
        "fullcite" "footfullcite"
        ;; "volcite" "Volcite" cannot support the syntax
        "notecite"  ;; "Notecite"
        "pnotecite" ;; "Pnotecite"
        "fnotecite"
        ;; multicites. Very limited support for these.
        "cites"      ;; "Cites"
        "parencites" ;; "Parencites"
        "footcites" "footcitetexts"
        "smartcites"  ;; "Smartcites"
        "textcites" ;; "Textcites"
        "supercites" "autocites"
        ;; "Autocites"
        ))
    
    ```
    
    I don't like the way ivy and helm org-ref-cite display possible citations. Moreover the system for choosing the correct NCS implementation for org-ref is a broken mess. Thus I manually set the desired values for the completion functions.
    
    `my/org-ref-ivy-insert-cite-link` works like `org-ref-ivy-insert-cite-link`, but with the prettier formatting of `ivy-bibtex`.
    
    ```elisp
    
    (defun my/org-ref-ivy-insert-cite-link ()
      (interactive)
      (let ((bibtex-completion-bibliography org-ref-bibliography-files))
        (setq org-ref-ivy-cite-marked-candidates '())
    
        (ivy-read "Open: " (bibtex-completion-candidates)
                  :require-match t
                  :keymap org-ref-ivy-cite-keymap
                  :re-builder org-ref-ivy-cite-re-builder
                  :action 'or-ivy-bibtex-insert-cite
                  :caller 'my/org-ref-ivy-insert-cite-link)))
    
    (setq org-ref-insert-link-function 'my/org-ref-ivy-insert-cite-link)
    (setq org-ref-insert-cite-function 'my/org-ref-ivy-insert-cite-link)
    (setq org-ref-insert-label-function 'org-ref-ivy-insert-label-link)
    (setq org-ref-insert-ref-function 'org-ref-ivy-insert-ref-link)
    (setq org-ref-cite-onclick-function 'org-ref-ivy-onclick-actions)
    
    ```

7.  Babel

    Org-babel is a system for literate programming with support for many popular languages. I use it to literally configure my Emacs editor.
    
    Don't uselessly split org-src windows.
    
    ```elisp
    (setq org-src-window-setup 'current-window)
    ```
    
    Make source code indentation work as expected.
    
    ```elisp
    (setq org-src-preserve-indentation nil 
          org-edit-src-content-indentation 0
          ;; [TODO make this work with custom bindings]
          org-src-tab-acts-natively t)
    ```
    
    Narrowed buffers support automatic saving to their parent buffers. Org-src tries to emulate this functionality but does not support the evil `:w` command. Manually add support for it here.
    
    ```elisp
    (advice-add 'evil-write :before-while 'my/advice-evil-write)
    (defun my/advice-evil-write (&rest ignore)
      (if (org-src-edit-buffer-p)
          (progn 
            (org-edit-src-save)
            nil)
        t))
    ```


<a id="org4ce92af"></a>

### RSS/Elfeed


<a id="org2caab55"></a>

# End

I'm pretty sure putting this here actually makes any difference for my setup but it seem to be tradition to have it.

```elisp
(provide 'init)
```

## Footnotes

<sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> Why? <https://www.anishathalye.com/2014/08/03/managing-your-dotfiles/>

<sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> extensions, packages, collections of elisp code, &#x2026;

<sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> some more context can be found [here](https://github.com/raxod502/straight.el#installing-org-with-straightel)

<sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> 't' in this case may also be replaced with a symbolic package name or any valid straight.el recipie

<sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> because of VC tracking, but this should not limit refactoring

<sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> this could be changed by always using use-package

<sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> while dired is technically used to find files, it is flexible enough to warrant being but under `Misc`

<sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> evil might sound like a prime candidate for the `Editing` section, but because it also provides utilities like a command prompt and global keybinds, I choose to put it unter `Integration`
