org-init.el

;; [[file:~/.emacs.d/init.org::*Org-ref][Org-ref:1]]
(use-package org-ref
  :straight t
  :after (org ivy-bibtex)
  :requires (doi-utils org-ref-isbn org-ref-ivy org-ref-helm)
  :init
  (setq org-ref-completion-library 'org-ref-ivy-cite))
;; Org-ref:1 ends here

;; [[file:~/.emacs.d/init.org::*Org-ref][Org-ref:2]]
(setq org-ref-biblatex-types
  '(;; "Cite"
    "parencite" ;; "Parencite"
    "footcite" "footcitetext"
    "textcite"  ;; "Textcite"
    "smartcite" ;; "Smartcite"
    "cite*" "parencite*" "supercite"
    "autocite"  ;; "Autocite"
    "autocite*" ;; "Autocite*"
    ;; "Citeauthor*"
    "citetitle" "citetitle*"
    "citedate" "citedate*"
    "citeurl"
    "fullcite" "footfullcite"
    ;; "volcite" "Volcite" cannot support the syntax
    "notecite"  ;; "Notecite"
    "pnotecite" ;; "Pnotecite"
    "fnotecite"
    ;; multicites. Very limited support for these.
    "cites"      ;; "Cites"
    "parencites" ;; "Parencites"
    "footcites" "footcitetexts"
    "smartcites"  ;; "Smartcites"
    "textcites" ;; "Textcites"
    "supercites" "autocites"
    ;; "Autocites"
    ))
;; Org-ref:2 ends here

;; [[file:~/.emacs.d/init.org::*Org-ref][Org-ref:3]]
(defun my/org-ref-ivy-insert-cite-link ()
  (interactive)
  (let ((bibtex-completion-bibliography org-ref-bibliography-files))
    (setq org-ref-ivy-cite-marked-candidates '())

    (ivy-read "Open: " (bibtex-completion-candidates)
	          :require-match t
	          :keymap org-ref-ivy-cite-keymap
	          :re-builder org-ref-ivy-cite-re-builder
	          :action 'or-ivy-bibtex-insert-cite
	          :caller 'my/org-ref-ivy-insert-cite-link)))

(setq org-ref-insert-link-function 'my/org-ref-ivy-insert-cite-link)
(setq org-ref-insert-cite-function 'my/org-ref-ivy-insert-cite-link)
(setq org-ref-insert-label-function 'org-ref-ivy-insert-label-link)
(setq org-ref-insert-ref-function 'org-ref-ivy-insert-ref-link)
(setq org-ref-cite-onclick-function 'org-ref-ivy-onclick-actions)
;; Org-ref:3 ends here

;; [[file:~/.emacs.d/init.org::*Babel][Babel:1]]
(setq org-src-window-setup 'current-window)
;; Babel:1 ends here

;; [[file:~/.emacs.d/init.org::*Babel][Babel:2]]
(setq org-src-preserve-indentation nil 
      org-edit-src-content-indentation 0
      ;; [TODO make this work with custom bindings]
      org-src-tab-acts-natively t)
;; Babel:2 ends here

;; [[file:~/.emacs.d/init.org::*Babel][Babel:3]]
(advice-add 'evil-write :before-while 'my/advice-evil-write)
(defun my/advice-evil-write (&rest ignore)
  (if (org-src-edit-buffer-p)
      (progn 
        (org-edit-src-save)
        nil)
    t))
;; Babel:3 ends here

;; [[file:~/.emacs.d/init.org::*End][End:1]]
(provide 'init)
;; End:1 ends here
